---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
OrdinateDimensionSetting Properties
OrdinateDimensionSetting Class See Also Send Feedback
---

The OrdinateDimensionSetting type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DimensionLineLength | Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented. |
|  | DimensionLineStyle | Specifies the dimension line style. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginTickMarkId | Specifies the id of the tick mark element to use for the dimension origin. |
|  | OriginVisibility | Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string). |
|  | TextOrientation | Specifies where to align the dimension text. |
|  | TextPosition | Specifies the dimension text position. |

# See Also

OrdinateDimensionSetting Class

Autodesk.Revit.DB Namespace